### Pandas

* Series
* DataFrame
* Dataset

In [1]:
import pandas as pd

In [14]:
a= pd.Series([1,2.6,3,4],index = ["a","b","c","d"])
a["b"]=30
a

a     1.0
b    30.0
c     3.0
d     4.0
dtype: float64

In [7]:
a[1:4]

b    2.6
c    3.0
d    4.0
dtype: float64

In [8]:
a["a":"d"]

a    1.0
b    2.6
c    3.0
d    4.0
dtype: float64

In [16]:
d = {"N1":"Srilalitha","N2":"Harideep","N3":"Nandini","N4":"Venkatesh"}
pd.Series(d)

N1    Srilalitha
N2      Harideep
N3       Nandini
N4     Venkatesh
dtype: object

### DataFrame(Table)

Collection of data in the form of rows and columns

In [24]:
import numpy as np
l = np.array([[1,"Lalitha",3,4,5],[3,4,5.8,6,7]])
s = pd.DataFrame(l,columns=["c1","c2","c3","c4","c5"])
#print(type(s))
s

  c1       c2   c3 c4 c5
0  1  Lalitha    3  4  5
1  3        4  5.8  6  7

In [23]:
marks = {"Name":["Srilalitha","Harideep","Nandini","Venkatesh"],
         "maths":[82,92,88,61],"Science":[56,88,91,76],"English":[63,100,88,56]}
pd.DataFrame(marks)

         Name  maths  Science  English
0  Srilalitha     82       56       63
1    Harideep     92       88      100
2     Nandini     88       91       88
3   Venkatesh     61       76       56

### Dataset

* .txt
* .csv(comma seperated values)
* .tsv(tab seperated values)

In [28]:
# Reading a file

df = pd.read_csv("marks.csv",header = None,names=["Student name","m1","m2","m3"])
df

  Student name  m1    m2    m3
0       Ganesh  56  92.0  81.0
1       Ramesh  45  56.0  88.0
2       Harish  56  77.0   NaN
3       Suresh  63  66.2   NaN
4     Priyanka  61  83.0  91.0
5     Namratha  88  64.0  82.0
6       Chinni  89  45.0  81.0

we are given a string s with w
task:-
to graph the string into a paragraph of width
input:-(A-Z) width=4

In [1]:
print("Uppercase Alphabets are:")
for i in range(65,91): 
        print(chr(i),end=' ')

Uppercase Alphabets are:
A B C D E F G H I J K L M N O P Q R S T U V W X Y Z

In [3]:
print("Uppercase Alphabets are:")
for i in range(65,91): 
        print(chr(i),end=' ')
        if n//4

SyntaxError: invalid syntax (<ipython-input-3-dc8f216c76df>, line 4)

In [ ]:
s=input()
 for i in s:
        if

In [2]:
result_str="";    
for row in range(0,7):    
    for column in range(0,7):     
        if ((column == 1 and row != 0 and row != 6) or ((row == 0 or row == 6) and column > 1 and column < 5) or (row == 3 and column > 2 and column < 6) or (column == 5 and row != 0 and row != 2 and row != 6)):  
            result_str=result_str+"*"    
        else:      
            result_str=result_str+" "    
    result_str=result_str+"\n"    
print(result_str);

  ***
 *   *
 *
 * ***
 *   *
 *   *
  ***